/*2351495 大数据 闫业豪*/
#define _CRT_SECURE_NO_WARNINGS
#include<stdio.h>
int main()
{
	int b; //除此之外，不允许定义任何其他变量 （包括常变量） 

	printf("请输入一个整数 : ");
	scanf("%d",&b);

	printf("==================================================\n");
	printf("0         1         2         3         4\n");
	printf("01234567890123456789012345678901234567890123456789\n");
	printf("==================================================\n");

	/* 按要求输出b的各种形式 -- Begin */ 
	printf("%d#\n",b);
	printf("%15d,%-15d#\n",b,b);
	printf("%015d,%-15d#\n",b,b);
	printf("%+d#\n",b);
	printf("%X#\n",b);
	printf("%x#\n",b);
	printf("%15x,%-15X#\n",b,b);
	printf("%-15X,%015x#\n",b,b);
	printf("%o#\n",b);
	printf("%-15o,%15o#\n",b,b);
	printf("%15o,%-15o#\n",b,b);
	/* 按要求输出b的各种形式 -- End */ 

	printf("==================================================\n");
	printf("01234567890123456789012345678901234567890123456789\n");
	printf("0         1         2         3         4\n");
	printf("==================================================\n");

	return 0;
}

