/*2351495 大数据 闫业豪*/
#include <iostream>
using namespace std;

/* ----具体要求----
   1、不允许添加其它头文件
   2、不允许再定义全局变量、静态局部变量
   3、不允许添加其它自定义函数
   ---------------------------------------------------------------------
*/

/***************************************************************************
  函数名称：
  功    能：输入一个符合要求的整数
  输入参数：根据no值x，打印“请输出第x个int型整数”
  返 回 值：
  说    明：函数名、形参、返回类型不准修改
***************************************************************************/
int get_int(int no)
{
	int num;
	while (1)
	{
		cout << "请输入第" << no << "个int型整数" << endl;
		if (!(cin >> num))
		{
			cin.clear();
			cin.ignore(2048, '\n');
			continue;
		}
		else
		{
			break;
		}
	}
	return num;
}

/***************************************************************************
  函数名称：
  功    能：将四个数按从小到大顺序输出
  输入参数：
  返 回 值：
  说    明：函数名、形参、返回类型不准修改
***************************************************************************/
void output(int a, int b, int c, int d)
{
	if (a > b)
	{
		int t = a;
		a = b;
		b = t;
	}
	if (a > c)
	{
		int t = a;
		a = c;
		c = t;
	}
	if (a > d)
	{
		int t = a;
		a = d;
		d = t;
	}
	if (b > c)
	{
		int t = b;
		b = c;
		c = t;
	}
	if (b > d)
	{
		int t = b;
		b = d;
		d = t;
	}
	if (c > d)
	{
		int t = c;
		c = d;
		d = t;
	}
	cout << "从小到大依次是 : " << a << ' ' << b << ' ' << c << ' ' << d << endl;
}

/***************************************************************************
  函数名称：
  功    能：
  输入参数：
  返 回 值：
  说    明：main不准动
***************************************************************************/
int main()
{
	int a, b, c, d;

	a = get_int(1);
	b = get_int(2);
	c = get_int(3);
	d = get_int(4);

	output(a, b, c, d);

	return 0;
}