/*2351495 大数据 闫业豪*/
#include <stdio.h>
#include <math.h>

/* ----具体要求----
   1、不允许添加其它头文件
   2、不允许再定义全局变量、静态局部变量
   3、不允许添加其它自定义函数
   ---------------------------------------------------------------------
*/

/***************************************************************************
  函数名称：
  功    能：给定x，返回函数 y=ax^3+bx^2+cx+d的值
  输入参数：
  返 回 值：
  说    明：函数名为f，返回值、输入参数自行定义
***************************************************************************/
double f(int a, int b, int c, int d, double x)
{
	double y = a * x * x * x + b * x * x + c * x + d;
	return y;
}

/***************************************************************************
  函数名称：
  功    能：求函数 y=ax^3+bx^2+cx+d在[x1..x2]区间的解
  输入参数：
  返 回 值：
  说    明：调用f函数求各y=f(x)的值
***************************************************************************/
double fun(int a, int b, int c, int d, double x1, double x2)
{
	double l = x1+ 1e-6, r = x2- 1e-6, mid = 0, t = 1e-6;
	double f_left = f(a, b, c, d, l);
	double f_right = f(a, b, c, d, r);
	while (1) 
	{ 
		mid = (l + r) / 2;
		double f_mid = f(a, b, c, d, mid);
		if (fabs(f_mid) < t) 
		{
			break;
		}

		if (f_mid * f_left < 0) 
		{
			r = mid;
			f_right = f_mid;
		}
		else 
		{
			l = mid;
			f_left = f_mid;
		}
	}
	return mid;
}

/***************************************************************************
  函数名称：
  功    能：
  输入参数：
  返 回 值：
  说    明：main函数已有部分不准动，添加自己需要的内容即可
***************************************************************************/
int main()
{
	int    a, b, c, d;
	double x1, x2;

	/* 打印使用说明 */
	printf("====使用说明==========================================================\n");
	printf(" 例1：求2x^3-9x^2+12x-3=0在[0 .. 1]之间的根，则依次输入2 -9 12 -3 0 1\n");
	printf(" 例2：求x^2-2=0在[0.8 .. 1.7]之间的根，则依次输入0 1 0 -2 0.8 1.7\n");
	printf(" 例3：求3x-2=0在[0.5 .. 1]之间的根，则依次输入0 0 3 -2 0.5 1\n");
	printf("======================================================================\n");

	/* 输入 */
	while (1) 
	{
		printf("请输入一元三次方程ax^3+bx^2+cx+d=0的各项系数、求根的区间[x1..x2]：\n");
		int res = scanf("%d %d %d %d %lf %lf", &a, &b, &c, &d, &x1, &x2);
		if (res == 6) 
		{ 
			while (getchar() != '\n');
			break;
		}
		else 
		{

			while (getchar() != '\n');
			printf("输入有错，请重新输入\n");
		}
	}
	/* 求解 */
	double x = fun(a, b, c, d, x1, x2);
	/* 打印 */
	printf("x=%.3f\n", x); //假设x为解

	return 0;
}
